TMH_Tester_JUnit1/TestPack/input/Regression_Testing_15.2/SS15/FCM/IMM_REJ_E613_OutClearing3.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:IFWXML_Channel="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Channel"
	xmlns:LTSB-SOAP="http://www.lloydstsb.com/Schema/Infrastructure/SOAP"
	xmlns:IFWXML_ResourceItem="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_ResourceItem"
	xmlns:LTSB-INFR="http://www.lloydstsb.com/Schema/Infrastructure"
	xmlns:IFWXML_AccountingTransaction="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_AccountingTransaction"
	xmlns:IFWXML_Arrangement="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Arrangement"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:IFWXML_Product="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Product"
	xmlns:IFWXML_Common="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Common"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:IFWXML_BusinessDirectionItem="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_BusinessDirectionItem"
	xmlns:IFWXML_Communication="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Communication"
	xmlns:IFWXML_Extnd="http://www.lloydstsb.com/Schema/Enterprise/IFWXML_Extended_Classes"
	xmlns:IFWXML_Location="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Location"
	xmlns:IFWXML_Event="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_Event"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:IFWXML_AccountingUnit="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_AccountingUnit"
	xmlns:IFWXML_InvolvedParty="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML_InvolvedParty"
	xmlns:IFWXML="http://xml.lloydsbanking.com/Schema/Enterprise/InformationTechnology/ESB/IFWXML"
	xmlns:IFWXML_WS="http://www.lloydstsb.com/Schema/ArrangementAccountProcessing/IFW">
	<SOAP-ENV:Header>
		<LTSB-SOAP:ServiceRequest>
			<LTSB-SOAP:ServiceName>http://www.lloydstsb.com/Schema/ArrangementAccountProcessing/IFW/ArrangementAccountProcessingService</LTSB-SOAP:ServiceName>
			<LTSB-SOAP:Action>N</LTSB-SOAP:Action>
			<LTSB-SOAP:From>TMH_TxnBus</LTSB-SOAP:From>
			<LTSB-SOAP:MessageId>NWBDM2I41734748</LTSB-SOAP:MessageId>
		</LTSB-SOAP:ServiceRequest>
		<wsse:Security>
			<wsse:UsernameToken Id="LloydsTSBSecurityToken" wsse:UNPMechanismType="LTPA" wsse:UserType="047">
				<wsse:Username>TMH_TxnBus</wsse:Username>
				<wsse:Password/>
			</wsse:UsernameToken>
		</wsse:Security>
		<LTSB-SOAP:ContactPoint>
			<LTSB-SOAP:ContactPointType>003</LTSB-SOAP:ContactPointType>
			<LTSB-SOAP:ContactPointId>0000309542</LTSB-SOAP:ContactPointId>
			<LTSB-SOAP:ApplicationId>AL05810</LTSB-SOAP:ApplicationId>
			<LTSB-SOAP:InitialOriginatorId>CE3000</LTSB-SOAP:InitialOriginatorId>
			<LTSB-SOAP:OperatorType>Customer</LTSB-SOAP:OperatorType>
		</LTSB-SOAP:ContactPoint>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<IFWXML_WS:ApplyPaymentPostingRequest>
			<accountingTransaction
				xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="IFWXML_AccountingTransaction:Transfer">
				<IFWXML_Common:objectReference xsi:type="IFWXML_Arrangement:ProductArrangementObjectReference">
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>1234567</IFWXML_Common:attributeString>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>SENDER_TO_RECIEVER_INFORMATION</IFWXML_Common:attributeString>
						<IFWXML_Common:value>INFORMATION</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>PROHIBITIVE_INDICATOR</IFWXML_Common:attributeString>
						<IFWXML_Common:value>Y</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>REMITTER_INFORMATION</IFWXML_Common:attributeString>
						<IFWXML_Common:value>datainfo</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>DEBIT_SERIAL_NUM</IFWXML_Common:attributeString>
						<IFWXML_Common:value>156284</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>REFERENCE_INFORMATION_1</IFWXML_Common:attributeString>
						<IFWXML_Common:value>800660</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>ACCOUNT_SWITCH_ACC_NUM</IFWXML_Common:attributeString>
						<IFWXML_Common:value>10463861</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>ACCOUNT_SWITCH_SORTCODE</IFWXML_Common:attributeString>
						<IFWXML_Common:value>800660</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>POSTING_DAY</IFWXML_Common:attributeString>
						<IFWXML_Common:value>01</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
				</IFWXML_Common:objectReference>
				<IFWXML_Event:description>F/Flow SERVIC C</IFWXML_Event:description>
				<IFWXML_Event:hasEventType>
					<IFWXML_Common:name>Principal Credit</IFWXML_Common:name>
				</IFWXML_Event:hasEventType>
				<IFWXML_AccountingTransaction:originationDate>2015-10-26T09:32:04</IFWXML_AccountingTransaction:originationDate>
				<IFWXML_AccountingTransaction:transactionItemType>12</IFWXML_AccountingTransaction:transactionItemType>
				<IFWXML_AccountingTransaction:valueDate>2015-10-27T09:32:04</IFWXML_AccountingTransaction:valueDate>
				<IFWXML_AccountingTransaction:initiatesMonetaryPosting>
					<IFWXML_AccountingUnit:accountingEffectType>Credit</IFWXML_AccountingUnit:accountingEffectType>
					<IFWXML_AccountingUnit:effectiveDate>2015-10-26T09:32:04</IFWXML_AccountingUnit:effectiveDate>
					<IFWXML_AccountingUnit:amount>
						<IFWXML:theCurrencyAmount>30.00</IFWXML:theCurrencyAmount>
						<IFWXML:theCurrencyCode>GBP</IFWXML:theCurrencyCode>
					</IFWXML_AccountingUnit:amount>
				</IFWXML_AccountingTransaction:initiatesMonetaryPosting>
				<IFWXML_AccountingTransaction:targets>
					<IFWXML_Common:objectReference xsi:type="IFWXML_Arrangement:ProductArrangementObjectReference">
						<IFWXML_Arrangement:accountNumber>40000003</IFWXML_Arrangement:accountNumber>
						<IFWXML_Arrangement:reversalTransactionReturnCode>6</IFWXML_Arrangement:reversalTransactionReturnCode>
						<IFWXML_Arrangement:npaAcctNum>12345678</IFWXML_Arrangement:npaAcctNum>
					</IFWXML_Common:objectReference>
					<IFWXML_Arrangement:isManagedByOrgUnit xsi:type="IFWXML_InvolvedParty:Branch">
						<IFWXML_InvolvedParty:sortCode>800663</IFWXML_InvolvedParty:sortCode>
						<IFWXML_InvolvedParty:npaSortCode>800660</IFWXML_InvolvedParty:npaSortCode>
					</IFWXML_Arrangement:isManagedByOrgUnit>
					<IFWXML_Arrangement:customer>
						<IFWXML_InvolvedParty:customerName>
							<IFWXML_InvolvedParty:nameText>SERVICE C</IFWXML_InvolvedParty:nameText>
						</IFWXML_InvolvedParty:customerName>
					</IFWXML_Arrangement:customer>
				</IFWXML_AccountingTransaction:targets>
			</accountingTransaction>
			<paymentPostingInstruction>
				<IFWXML_Common:objectReference
					xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="IFWXML_AccountingTransaction:PaymentPostingInstructionObjectReference">
					<IFWXML_Common:refId>IMM_REJ_E613_OutClearing3</IFWXML_Common:refId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>ACCOUNT_TYPE</IFWXML_Common:attributeString>
						<IFWXML_Common:value>Personal Account</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>TRANSACTION_SUB_TYPE</IFWXML_Common:attributeString>
						<IFWXML_Common:value>Outclearing</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
					<IFWXML_Common:alternateId>
						<IFWXML_Common:attributeString>POSTING_DAY</IFWXML_Common:attributeString>
						<IFWXML_Common:value>2</IFWXML_Common:value>
					</IFWXML_Common:alternateId>
				</IFWXML_Common:objectReference>
				<IFWXML_AccountingTransaction:scheme>
					<IFWXML_AccountingTransaction:schemeName>ICS</IFWXML_AccountingTransaction:schemeName>
				</IFWXML_AccountingTransaction:scheme>
				<IFWXML_AccountingTransaction:transactionType>REJ</IFWXML_AccountingTransaction:transactionType>
			</paymentPostingInstruction>
			<batchPayment>
				<IFWXML_Event:itemCount>10</IFWXML_Event:itemCount>
			</batchPayment>
			<paymentExceptionInstruction>
				<IFWXML_AccountingTransaction:originalSettlementAmount>
					<IFWXML:theCurrencyAmount>30.00</IFWXML:theCurrencyAmount>
				</IFWXML_AccountingTransaction:originalSettlementAmount>
			</paymentExceptionInstruction>
		</IFWXML_WS:ApplyPaymentPostingRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
